#### Terraform Apply 📖`success`

<details><summary>Show Plan</summary>

```[0m[1mgithub_membership.satake: Refreshing state... [id=satake-test:isSatake][0m
[0m[1mgithub_team.root-team: Refreshing state... [id=9269919][0m
[0m[1mgithub_team_members.root-team-members: Refreshing state... [id=9269919][0m
[0m[1mgithub_team.child-team: Refreshing state... [id=9269929][0m
[0m[1mgithub_team_members.child-team-members: Refreshing state... [id=9269929][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # github_team.grandchild-team[0m will be created
[0m  [32m+[0m[0m resource "github_team" "grandchild-team" {
      [32m+[0m[0m create_default_maintainer = false
      [32m+[0m[0m etag                      = (known after apply)
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m members_count             = (known after apply)
      [32m+[0m[0m name                      = "grandchild-team"
      [32m+[0m[0m node_id                   = (known after apply)
      [32m+[0m[0m parent_team_id            = "9269929"
      [32m+[0m[0m parent_team_read_id       = (known after apply)
      [32m+[0m[0m parent_team_read_slug     = (known after apply)
      [32m+[0m[0m privacy                   = "closed"
      [32m+[0m[0m slug                      = (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m[1mgithub_team.grandchild-team: Creating...[0m[0m
[0m[1mgithub_team.grandchild-team: Creation complete after 3s [id=9283806][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[0m```

</details>